Ran Plan for 4 projects:

1. dir: `live/stag/instances/bastion-server` workspace: `default`
1. dir: `live/stag/instances/loadbalancer` workspace: `default`
1. dir: `live/stag/instances/webserver` workspace: `default`
1. dir: `live/stag` workspace: `default`
---

### 1. dir: `live/stag/instances/bastion-server` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-05-31T13:57:25Z level=info msg=Downloading Terraform configurations from file:///root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/modules/instances into /root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/bastion-server/.terragrunt-cache/e8D_kcLWZSv_Tf8T-3t7sNvQBKA/-XgcPZjnHAlEAgm_wCFLRP39AD0
time=2024-05-31T13:57:25Z level=warning msg=The following inputs passed in by terragrunt are unused:
 prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/bastion-server] 
time=2024-05-31T13:57:25Z level=warning msg=	- ssh-keys prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/bastion-server] 
time=2024-05-31T13:57:25Z level=warning msg=	- region prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/bastion-server] 
time=2024-05-31T13:57:25Z level=warning msg=	- zone prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/bastion-server] 
time=2024-05-31T13:57:25Z level=warning msg=	- project prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/bastion-server] 
time=2024-05-31T13:57:25Z level=warning prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/bastion-server] 
time=2024-05-31T13:57:25Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/bastion-server] 
time=2024-05-31T13:57:25Z level=warning msg=Terragrunt configuration has misaligned inputs, but running in relaxed mode so ignoring. prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/bastion-server] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.30.0"...
- Installing hashicorp/google v5.30.0...
- Installed hashicorp/google v5.30.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.vm-demo will be created
  + resource "google_compute_instance" "vm-demo" {
      + allow_stopping_for_update = false
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + effective_labels          = (known after apply)
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-micro"
      + metadata                  = {
          + "ssh-keys" = "<USER>:<YOUR_SSH_PUBLIC_KEY>"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "staging-bastion-server"
      + project                   = "studidevops-batch-12"
      + self_link                 = (known after apply)
      + tags                      = [
          + "http-server",
        ]
      + tags_fingerprint          = (known after apply)
      + terraform_labels          = (known after apply)
      + zone                      = "asia-southeast2-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = (known after apply)
              + type                   = (known after apply)
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_ip_private = (known after apply)
  + vm_ip_public  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/bastion-server/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/bastion-server/default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d live/stag/instances/bastion-server
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://34.101.105.228/lock?id=mfakhriabdillah%252Fatlantis-batch-13%252Flive%252Fstag%252Finstances%252Fbastion-server%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d live/stag/instances/bastion-server
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `live/stag/instances/loadbalancer` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-05-31T13:57:32Z level=info msg=Downloading Terraform configurations from file:///root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/modules/instances into /root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/loadbalancer/.terragrunt-cache/52kbnrjjgYN8_5OoFWLhzkcLCt4/-XgcPZjnHAlEAgm_wCFLRP39AD0
time=2024-05-31T13:57:32Z level=warning msg=The following inputs passed in by terragrunt are unused:
 prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/loadbalancer] 
time=2024-05-31T13:57:32Z level=warning msg=	- ssh-keys prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/loadbalancer] 
time=2024-05-31T13:57:32Z level=warning msg=	- region prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/loadbalancer] 
time=2024-05-31T13:57:32Z level=warning msg=	- zone prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/loadbalancer] 
time=2024-05-31T13:57:32Z level=warning msg=	- project prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/loadbalancer] 
time=2024-05-31T13:57:32Z level=warning prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/loadbalancer] 
time=2024-05-31T13:57:32Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/loadbalancer] 
time=2024-05-31T13:57:32Z level=warning msg=Terragrunt configuration has misaligned inputs, but running in relaxed mode so ignoring. prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/loadbalancer] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.30.0"...
- Installing hashicorp/google v5.30.0...
- Installed hashicorp/google v5.30.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.vm-demo will be created
  + resource "google_compute_instance" "vm-demo" {
      + allow_stopping_for_update = false
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + effective_labels          = (known after apply)
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-micro"
      + metadata                  = {
          + "ssh-keys" = "<USER>:<YOUR_SSH_PUBLIC_KEY>"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "staging-loadbalancer"
      + project                   = "studidevops-batch-12"
      + self_link                 = (known after apply)
      + tags                      = [
          + "http-server",
        ]
      + tags_fingerprint          = (known after apply)
      + terraform_labels          = (known after apply)
      + zone                      = "asia-southeast2-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = (known after apply)
              + type                   = (known after apply)
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_ip_private = (known after apply)
  + vm_ip_public  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/loadbalancer/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/loadbalancer/default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d live/stag/instances/loadbalancer
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://34.101.105.228/lock?id=mfakhriabdillah%252Fatlantis-batch-13%252Flive%252Fstag%252Finstances%252Floadbalancer%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d live/stag/instances/loadbalancer
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 3. dir: `live/stag/instances/webserver` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-05-31T13:57:40Z level=info msg=Downloading Terraform configurations from file:///root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/modules/instances into /root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/webserver/.terragrunt-cache/jJpGh2pD07cLCpIUQPcveFoZfIs/-XgcPZjnHAlEAgm_wCFLRP39AD0
time=2024-05-31T13:57:40Z level=warning msg=The following inputs passed in by terragrunt are unused:
 prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/webserver] 
time=2024-05-31T13:57:40Z level=warning msg=	- region prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/webserver] 
time=2024-05-31T13:57:40Z level=warning msg=	- ssh-keys prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/webserver] 
time=2024-05-31T13:57:40Z level=warning msg=	- project prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/webserver] 
time=2024-05-31T13:57:40Z level=warning msg=	- zone prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/webserver] 
time=2024-05-31T13:57:40Z level=warning prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/webserver] 
time=2024-05-31T13:57:40Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/webserver] 
time=2024-05-31T13:57:40Z level=warning msg=Terragrunt configuration has misaligned inputs, but running in relaxed mode so ignoring. prefix=[/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/webserver] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.30.0"...
- Installing hashicorp/google v5.30.0...
- Installed hashicorp/google v5.30.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.vm-demo will be created
  + resource "google_compute_instance" "vm-demo" {
      + allow_stopping_for_update = false
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + effective_labels          = (known after apply)
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-micro"
      + metadata                  = {
          + "ssh-keys" = "<USER>:<YOUR_SSH_PUBLIC_KEY>"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "staging-webserver"
      + project                   = "studidevops-batch-12"
      + self_link                 = (known after apply)
      + tags                      = [
          + "allow-jenkins",
          + "http-server",
        ]
      + tags_fingerprint          = (known after apply)
      + terraform_labels          = (known after apply)
      + zone                      = "asia-southeast2-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = (known after apply)
              + type                   = (known after apply)
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_ip_private = (known after apply)
  + vm_ip_public  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/webserver/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag/instances/webserver/default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d live/stag/instances/webserver
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://34.101.105.228/lock?id=mfakhriabdillah%252Fatlantis-batch-13%252Flive%252Fstag%252Finstances%252Fwebserver%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d live/stag/instances/webserver
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 4. dir: `live/stag` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag": 
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

Error: No configuration files

Plan requires configuration to be present. Planning without a configuration
would mark everything for destruction, which is normally not what is desired.
If you would like to destroy everything, run plan with the -destroy option.
Otherwise, create a Terraform configuration file (.tf file) and try again.
time=2024-05-31T13:57:46Z level=error msg=terraform invocation failed in /root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag
time=2024-05-31T13:57:46Z level=error msg=1 error occurred:
	* [/root/.atlantis/repos/mfakhriabdillah/atlantis-batch-13/1/default/live/stag] exit status 1



time=2024-05-31T13:57:46Z level=warning msg=The following inputs passed in by terragrunt are unused:

time=2024-05-31T13:57:46Z level=warning msg=	- region
time=2024-05-31T13:57:46Z level=warning msg=	- vm_machine_type
time=2024-05-31T13:57:46Z level=warning msg=	- vm_name
time=2024-05-31T13:57:46Z level=warning msg=	- zone
time=2024-05-31T13:57:46Z level=warning msg=	- project
time=2024-05-31T13:57:46Z level=warning
time=2024-05-31T13:57:46Z level=info msg=All required inputs are passed in by terragrunt
time=2024-05-31T13:57:46Z level=warning msg=Terragrunt configuration has misaligned inputs, but running in relaxed mode so ignoring.

```
</details>

---
### Plan Summary

4 projects, 3 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```